src/InformationRegisters/Scan_РасчетOrderIntake/Scan_РасчетOrderIntake.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_РасчетOrderIntake</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВесСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>OrderIntake</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаOrderIntake</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КРасчету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПрекращен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.Scan_ВидыСобытийOrderIntake</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.Scan_ДатыДляФормированияОтчетаOI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_РасчетOrderIntake/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	
	ОчиститьРасчетЗаписиНаКлиенте();
	ЗаполнитьВидСобытияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСобытияПриИзменении(Элемент)
	
	ОчиститьРасчетЗаписиНаКлиенте();
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьРасчетЗаписиНаКлиенте()
	
	Запись.ВесСобытия      = 0;
	Запись.Остаток         = 0;
	Запись.OrderIntake     = 0;
	Запись.ДатаOrderIntake = Дата(1,1,1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидСобытияНаСервере()
	
	Запись.ВидСобытия = Scan_OrderIntake.ВидСобытияOrderIntake(Запись.Событие);
	
КонецПроцедуры

#КонецОбласти
